Tekla Open API Reference for Tekla Structures 2025
DetailMarkAttributes Constructor
Overload List
Name | Description
DetailMark.DetailMarkAttributes()
 Creates a new default DetailMarkAttributes instance that loads standard attributes.
DetailMark.DetailMarkAttributes(String)
 Creates a new DetailMarkAttributes instance that loads the specified attributes.
Top
See Also
Reference
DetailMark.DetailMarkAttributes Class
Tekla.Structures.Drawing Namespace